<template>
  <div>
    <showCode :title="title" :isExecute='false' :code.sync="code"></showCode>
  </div>
</template>
<script>
export default {
  data () {
    return {
      code: `
      ### 面向过程编程
面向过程编程（procedure oriented Programming）（POP）

面向过程编程就是分析出解决问题所需要的步骤，然后用函数把这些步骤一步一步实现，使用的时候一个一个依次调用就可以了。

### 面向对象编程

面向对象编程（object oriented programming）(OOP)

面向对象编程是把构成问题的事务分解成各个对象，建立对象的目的不是为了完成一个步骤，而是为了描叙某个事物在整个解决问题的步骤中的行为;

  ### 面向过程

优点：性能比面向对象高，因为类调用时需要实例化，开销比较大，比较消耗资源

缺点：没有面向对象易维护、易复用、易扩展

适用：适合解决简单问题场景

### 面向对象

优点：易维护、易复用、易扩展，由于面向对象有封装、继承、多态性的特性，可以设计出低耦合的系统，使系统 更加灵活、更加易于维护

缺点：性能比面向过程低

适用：适合复杂的问题场景，适合对可维护性和复用性要求高的
      `,
      title: '面向过程编程和面向对象编程有什么区别？'
    }
  },
  mounted () {
    // 单利模式本身是一个闭包
    `### 面向过程编程
面向过程编程（procedure oriented Programming）（POP）

面向过程编程就是分析出解决问题所需要的步骤，然后用函数把这些步骤一步一步实现，使用的时候一个一个依次调用就可以了。

### 面向对象编程

面向对象编程（object oriented programming）(OOP)

面向对象编程是把构成问题的事务分解成各个对象，建立对象的目的不是为了完成一个步骤，而是为了描叙某个事物在整个解决问题的步骤中的行为;

  ### 面向过程

优点：性能比面向对象高，因为类调用时需要实例化，开销比较大，比较消耗资源

缺点：没有面向对象易维护、易复用、易扩展

适用：适合解决简单问题场景

### 面向对象

优点：易维护、易复用、易扩展，由于面向对象有封装、继承、多态性的特性，可以设计出低耦合的系统，使系统 更加灵活、更加易于维护

缺点：性能比面向过程低

适用：适合复杂的问题场景，适合对可维护性和复用性要求高的
`
  }
}
</script>
